In [53]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Data Understanding

In [54]:
df = pd.read_csv('housePrice.csv', encoding='ISO-8859-1')

In [55]:
df.head(5)

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,True,True,True,Shahran,1.850000e+09,61666.67
1,60,1,True,True,True,Shahran,1.850000e+09,61666.67
2,79,2,True,True,True,Pardis,5.500000e+08,18333.33
3,95,2,True,True,True,Shahrake Qods,9.025000e+08,30083.33
4,123,2,True,True,True,Shahrake Gharb,7.000000e+09,233333.33

In [56]:
df = df.drop("Price", axis = 1)

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3479 entries, 0 to 3478
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Area        3479 non-null   object
 1   Room        3479 non-null   int64
 2   Parking     3479 non-null   bool
 3   Warehouse   3479 non-null   bool
 4   Elevator    3479 non-null   bool
 5   Address     3456 non-null   object
 6   Price(USD)  3479 non-null   float64
dtypes: bool(3), float64(1), int64(1), object(2)
memory usage: 119.0+ KB

In [58]:
df['Area'] = pd.to_numeric(df['Area'], errors='coerce')

In [59]:
df.isnull().sum()

Area           6
Room           0
Parking        0
Warehouse      0
Elevator       0
Address       23
Price(USD)     0
dtype: int64

In [60]:
df[df[['Area', 'Address']].isnull().any(axis=1)]

       Area  Room  Parking  Warehouse  Elevator            Address  Price(USD)
43     60.0     2     True       True      True                NaN    88333.33
570     NaN     2     True       True      True        Ostad Moein   110333.33
662    85.0     2     True       True      True                NaN    65166.67
706   117.0     2     True       True      True                NaN   216666.67
709     NaN     3     True       True      True           Pasdaran   538666.67
807     NaN     2     True       True     False           Damavand   233333.33
1108   77.0     2     True       True     False                NaN    67333.33
1109   71.0     1     True       True      True                NaN    76666.67
1577  100.0     2     True       True      True                NaN   103333.33
1604    NaN     2     True       True      True         Gheitarieh   290000.00
1796   70.0     2     True       True      True                NaN   161000.00
2071   94.0     2     True       True      True                NaN   100000.00
2072   99.0     2     True       True      True                NaN   138333.33
2127   63.0     1     True       True     False                NaN    24333.33
2171    NaN     2    False      False     False           Shahryar   324000.00
2243   62.0     2     True      False      True                NaN    48000.00
2337   42.0     1    False       True     False                NaN    21333.33
2426   65.0     1    False      False     False                NaN    21666.67
2728   85.0     2     True       True      True                NaN    22500.00
2802    NaN     2     True       True      True  Central Janatabad    85000.00
3025   89.0     2     True       True      True                NaN   103333.33
3176   74.0     2     True       True      True                NaN    56633.67
3262  115.0     2     True       True      True                NaN   168666.67
3295   72.0     2     True       True     False                NaN    30000.00
3315  120.0     2     True       True      True                NaN    48000.00
3318  103.0     2     True       True      True                NaN    38333.33
3355  135.0     3     True       True      True                NaN    50000.00
3401   78.0     2     True      False      True                NaN    24666.67
3434   87.0     2     True       True      True                NaN    22666.67